import 'package:flutter/material.dart';
import 'package:get/get.dart';
import 'package:muslim_app/app/modules/quran/controllers/quran_controller.dart';
import 'package:muslim_app/theme.dart';

import 'frame.dart';
import 'header.dart';
import 'index.dart';

class PaperView extends GetView<QuranController> {
  @override
  Widget build(BuildContext context) {
    Size size = MediaQuery.of(context).size;
    return Scaffold(
        body: Column(
      children: [
        HeaderWidget(),
        Stack(children: [
          FrameWidget(),
          Align(
            alignment: Alignment.center,
            child: Container(
              padding: EdgeInsets.symmetric(vertical: 8),
              height: size.height - 200,
              width: size.width,
              child: ListView(
                physics: BouncingScrollPhysics(),
                padding: EdgeInsets.symmetric(horizontal: 40, vertical: 30),
                children: [
                  RichText(
                      textAlign: TextAlign.justify,
                      text: TextSpan(
                        text:
                            "مَا كَانَ لِاَهْلِ الْمَدِيْنَةِ وَمَنْ حَوْلَهُمْ مِّنَ الْاَعْرَابِ اَنْ يَّتَخَلَّفُوْا عَنْ رَّسُوْلِ اللّٰهِ وَلَا يَرْغَبُوْا بِاَنْفُسِهِمْ عَنْ نَّفْسِهٖۗ ذٰلِكَ بِاَنَّهُمْ لَا يُصِيْبُهُمْ ظَمَاٌ وَّلَا نَصَبٌ وَّلَا مَخْمَصَةٌ فِيْ سَبِيْلِ اللّٰهِ وَلَا يَطَـُٔوْنَ مَوْطِئًا يَّغِيْظُ الْكُفَّارَ وَلَا يَنَالُوْنَ مِنْ عَدُوٍّ نَّيْلًا اِلَّا كُتِبَ لَهُمْ بِهٖ عَمَلٌ صَالِحٌۗ اِنَّ اللّٰهَ لَا يُضِيْعُ اَجْرَ الْمُحْسِنِيْنَ مَا كَانَ لِاَهْلِ الْمَدِيْنَةِ وَمَنْ حَوْلَهُمْ مِّنَ الْاَعْرَابِ اَنْ يَّتَخَلَّفُوْا عَنْ رَّسُوْلِ اللّٰهِ وَلَا يَرْغَبُوْا بِاَنْفُسِهِمْ عَنْ نَّفْسِهٖۗ ذٰلِكَ بِاَنَّهُمْ لَا يُصِيْبُهُمْ ظَمَاٌ وَّلَا نَصَبٌ وَّلَا مَخْمَصَةٌ فِيْ سَبِيْلِ اللّٰهِ وَلَا يَطَـُٔوْنَ مَوْطِئًا يَّغِيْظُ الْكُفَّارَ وَلَا يَنَالُوْنَ مِنْ عَدُوٍّ نَّيْلًا اِلَّا كُتِبَ لَهُمْ بِهٖ عَمَلٌ صَالِحٌۗ اِنَّ اللّٰهَ لَا يُضِيْعُ اَجْرَ الْمُحْسِنِيْنَ مَا كَانَ لِاَهْلِ الْمَدِيْنَةِ وَمَنْ حَوْلَهُمْ مِّنَ الْاَعْرَابِ اَنْ يَّتَخَلَّفُوْا عَنْ رَّسُوْلِ اللّٰهِ وَلَا يَرْغَبُوْا بِاَنْفُسِهِمْ عَنْ نَّفْسِهٖۗ ذٰلِكَ بِاَنَّهُمْلَا نَصَبٌ وَّلَا مَخْمَصَةٌ فِيْ سَبِيْلِ اللّٰهِ وَلَا عَدُوٍّ نَّيْلًا اِلَّا ك"
                            "مَا كَانَ لِاَهْلِ الْمَدِيْنَةِ وَمَنْ حَوْلَهُمْ مِّنَ الْاَعْرَابِ اَنْ يَّتَخَلَّفُوْا عَنْ رَّسُوْلِ اللّٰهِ وَلَا يَرْغَبُوْا بِاَنْفُسِهِمْ عَنْ نَّفْسِهٖۗ ذٰلِكَ بِاَنَّهُمْ لَا يُصِيْبُهُمْ ظَمَاٌ وَّلَا نَصَبٌ وَّلَا مَخْمَصَةٌ فِيْ سَبِيْلِ اللّٰهِ وَلَا يَطَـُٔوْنَ مَوْطِئًا يَّغِيْظُ الْكُفَّارَ وَلَا يَنَالُوْنَ مِنْ عَدُوٍّ نَّيْلًا اِلَّا كُتِبَ لَهُمْ بِهٖ عَمَلٌ صَالِحٌۗ اِنَّ اللّٰهَ لَا يُضِيْعُ اَجْرَ الْمُحْسِنِيْنَ مَا كَانَ لِاَهْلِ الْمَدِيْنَةِ وَمَنْ حَوْلَهُمْ مِّنَ الْاَعْرَابِ اَنْ يَّتَخَلَّفُوْا عَنْ رَّسُوْلِ اللّٰهِ وَلَا يَرْغَبُوْا بِاَنْفُسِهِمْ عَنْ نَّفْسِهٖۗ ذٰلِكَ بِاَنَّهُمْ لَا يُصِيْبُهُمْ ظَمَاٌ وَّلَا نَصَبٌ وَّلَا مَخْمَصَةٌ فِيْ سَبِيْلِ اللّٰهِ وَلَا يَطَـُٔوْنَ مَوْطِئًا يَّغِيْظُ الْكُفَّارَ وَلَا يَنَالُوْنَ مِنْ عَدُوٍّ نَّيْلًا اِلَّا كُتِبَ لَهُمْ بِهٖ عَمَلٌ صَالِحٌۗ اِنَّ اللّٰهَ لَا يُضِيْعُ اَجْرَ الْمُحْسِنِيْنَ مَا كَانَ لِاَهْلِ الْمَدِيْنَةِ وَمَنْ حَوْلَهُمْ مِّنَ الْاَعْرَابِ اَنْ يَّتَخَلَّفُوْا عَنْ رَّسُوْلِ اللّٰهِ وَلَا يَرْغَبُوْا بِاَنْفُسِهِمْ عَنْ نَّفْسِهٖۗ ذٰلِكَ بِاَنَّهُمْلَا نَصَبٌ وَّلَا مَخْمَصَةٌ فِيْ سَبِيْلِ اللّٰهِ وَلَا عَدُوٍّ نَّيْلًا اِلَّا ك",
                        style: lightTextStyle.copyWith(
                            fontSize: 30, color: blackColor),
                      )),
                ],
              ),
            ),
          )
        ]),
        IndexWidget(),
      ],
    ));
  }
}
